---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceNormal
source: html/f9f4568a-bc6b-f618-5dd3-e79b5fbfa172.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque.SurfaceNormal Property

The property labeled "Image" from the "AdvancedOpaque" schema.

## Syntax (C#)
```csharp
public static string SurfaceNormal { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.